In [1]:
import pandas as pd

In [20]:
df=pd.DataFrame({'nome': ['Ana', 'Carlos', 'João','Flora','Pedro','Tomas'],
    'cidade': ['Maputo', 'Niassa', 'Tete', 'Gaza', 'Inhambane','Tete']})

df1=df
df2=df

In [15]:
# Using Map method
df1["cidade"]=df1["cidade"].map({"Maputo":0,"Niassa":1,"Tete":2,"Gaza":3, "Inhambane":4})

df1

     nome  cidade
0     Ana       0
1  Carlos       1
2    João       2
3   Flora       3
4   Pedro       4
5   Tomas       2

In [21]:
#Using LabelEncoder (Automatic)

from sklearn.preprocessing import LabelEncoder
le= LabelEncoder()
df2["cidade"]=le.fit_transform(df2["cidade"])
df2

     nome  cidade
0     Ana       2
1  Carlos       3
2    João       4
3   Flora       0
4   Pedro       1
5   Tomas       4